Repository: DMouayad/sham_cars_flutter
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: Sham Cars
ar: الدليل الشافي

# loadingBarrierDefaultText
source: Please wait...
ar: الرجاء الانتظار...

source: Cancel
ar: إلغاء

source: Ok
ar: حسناً

source: Or
ar: أو

source: sec
ar: ثانية

source: min
ar: دقيقة

# pasteBtnLabel
source: Paste
ar: لصق

# continueBtnLabel
source: Continue
ar: متابعة

# viewAllBtnLabel
source: view all
ar: عرض الكل

# signedInAs
source: You're signed in as
ar: أنت مسجل كـ

# signedInWith
source: You're signed in with
ar: أنت مسجل بـ

# logoutBtnLabel
source: Logout
ar: تسجيل الخروج

# drawerThemeModeSwitchTitle
source: Color mode
ar: نمط الألوان

# darkThemeMode
source: Dark
ar: داكن

# lightThemeMode
source: Light
ar: فاتح

# systemThemeMode
source: Device
ar: مطابق للجهاز

# drawerLanguageBtnLabel
source: Language
ar: لغة التطبيق

# supportBtnLabel
source: Need help?
ar: تحتاج المساعدة؟

# fAQTileLabel
source: FAQ
ar: الأسئلة الشائعة

# contactUsTileLabel
source: Contact Us
ar: اتصل بنا

# termsTileLabel
source: Terms and Conditions
ar: الشروط وسياسات الاستخدام

# drawerAboutTheAppTile
source: About the app
ar: عن التطبيق

# userProfileScreenTitle
source: Profile
ar: حسابي الشخصي

# publicProfileSettingsTileLabel
source: Personal Info
ar: المعلومات الشخصية

# accountSettingsTileLabel
source: Account Settings
ar: إعدادت الحساب

# deleteAccountBtnLabel
source: Delete my account
ar: حذف حسابي

# changePasswordBtnLabel
source: Change password
ar: تغيير كلمة المرور

# logoutFailureDialogTitle
source: Logout Failed!
ar: فشل تسجيل الخروج

# searchScreenTitle
source: Search in Sham Cars
ar: ابحث في الدليل الشافي

# removeFilters
source: Remove all
ar: مسح الكل

# applyFilters
source: Apply
ar: تطبيق

# aboutDoctorSectionTitle
source: About the doctor
ar: عن الطبيب

# aboutFacilitySectionTitle
source: About the facility
ar: عن المنشأة

source: Location on map
ar: الموقع على الخريطة

# loginFailureDialogTitle
source: Login Failed!
ar: فشل تسجيل الدخول!

# passwordIsRequired
source: Please enter your password
ar: يرجى إدخال كلمة المرور

# passwordValidationError
source: Password must be, at lease, 8 characters and have one or more non-alphanumeric character and one or more uppercase letter
ar: يجب أن يكون كلمة المرور مكونة من 8 أحرف على الأقل، ويجب أن تحتوي على حرف أو رقم أو رمز خاص

# passwordConfirmationIsRequired
source: Please confirm your password
ar: يرجى إدخال كلمة المرور ذاتها مرة أخرى

# passwordRuleLength
source: Have 8 characters at least
ar: مكونة من 8 أحرف على الأقل

# passwordRuleUppercase
source: Have an uppercase letter
ar: تحتوي على حرف كبير

# passwordRuleLowercase
source: Have a lowercase letter
ar: تحتوي على حرف صغير

# passwordRuleNumber
source: Have a number
ar: تحتوي على رقم

# passwordConfirmationMismatch
source: The two passwords don't match!
ar: كلمتا المرور غير متطابقتين

# phoneNumberIsRequired
source: Please enter your phone number
ar: يرجى إدخال رقم الموبايل الخاص بك

# emailIsRequired
source: Please enter your email address
ar: يرجى إدخال عنوان بريدك الالكتروني

# emailFieldLabel
source: Email
ar: البريد الالكتروني

# emailOrPhoneFieldLabel
source: Email or phone
ar: البريد الالكتروني أو رقم الهاتف

# emailOrPhoneIsRequired
source: Please enter your email or phone number
ar: يرجى إدخال عنوان بريدك الالكتروني أو رقم الهاتف الخاص بك

# emailOrPhoneIsInvalid
source: Please enter a valid email or phone number
ar: يرجى إدخال عنوان بريد الكتروني صحيح أو رقم هاتف صحيح

# emailOrPhoneFieldHint
source: johnDoe@example.com or 0912345678
ar: me@example.com أو 0912345678

# emailFieldHint
source: johnDoe@example.com
ar: me@example.com

# passwordFieldLabel
source: Password
ar: كلمة المرور

# passwordConfirmationFieldLabel
source: Password confirmation
ar: تأكيد كلمة المرور

# passwordConfirmationFieldHint
source: Enter the same password as in the previous field
ar: أعد إدخال كلمة المرور

# phoneNumberFieldLabel
source: Phone number
ar: رقم الموبايل

# phoneNumberFieldHint
source: start with 09
ar: ابدأ بـ09

# usernameIsRequired
source: Please enter your full name
ar: يرجى إدخال اسمك الكامل

# usernameFieldLabel
source: Full name
ar: الاسم الكامل

# usernameFieldHint
source: First and last name
ar: الاسم والكنية

# loginBtnLabel
source: Login
ar: تسجيل الدخول

# registerBtnLabel
source: Register
ar: إنشاء حساب

source: Show
ar: عرض

source: Hide
ar: إخفاء

# exitSignupProcessBtnLabel
source: Exit
ar: الخروج من عملية التسجيل

# continueSignupBtnLabel
source: Continue signing up
ar: متابعة التسجيل

# confirmExitingSignupDialogTitle
source: Are you sure you want to exit the signup process?
ar: هل أنت متأكد من رغبتك في الخروج من عملية التسجيل؟

# confirmExitingSignupDialogMessage
source: The entered information will be lost
ar: في حال عدم متابعتك لخطوات إنشاء الحساب فلن يتم الاحتفاظ بالبيانات المدخلة

# phoneNumberIsInvalid
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صحيح

# emailIsInvalid
source: Please enter a valid email address
ar: يرجى إدخال بريد الكتروني صحيح مثال:example@gmail.com

source: Login in progress...
ar: جار تسجيل الدخول...

# createPasswordMessage
source: Create your password
ar: إنشاء كلمة المرور

# appGreeting
source: Welcome to Sham Cars
ar: أهلاً بكم في تطبيق الدليل الشافي

# loginScreenSubtitle
source: Login to your account
ar: تسجيل الدخول إلى حسابي

# noAccountQuestion
source: Don't have an account?
ar: ليس لديك حساب؟

# alreadyHaveAnAccountQuestion
source: Already have an account?
ar: لديك حساب؟

# forgotPasswordBtnLabel
source: Forgot password?
ar: نسيت كلمة المرور؟

# createAccountBtnLabel
source: Create an account
ar: إنشاء حساب

# maleGender
source: male
ar: ذكر

# femaleGender
source: female
ar: أنثى

# genderInputTitle
source: Your gender
ar: الجنس

# emailVerificationScreenTitle
source: Please verify your email address
ar: التحقق من البريد الإلكتروني

# emailVerificationScreenSubtitle
source: This help us confirm your identity & protect your account
ar: تساعدنا هذه الخطوة في التأكد من هويتك وحماية بياناتك

# emailVerificationCodeWasSent
source: Please enter the verification code sent to
ar: أدخل رمز التحقق المرسل على البريد الإلكتروني

# emailVerificationErrorDialogTitle
source: Failed to verify your email
ar: فشل التحقق من بريدك الإلكتروني

# didNotReceiveCode
source: Did not receive a code?
ar: لم يصلك الرمز؟

# resendVerificationCodeIn
source: You can request a new code in
ar: يمكنك طلب رمز جديد خلال

# resendVerificationCodeBtnLabel
source: send me a new code
ar: طلب رمز جديد

# verifyBtnLabel
source: Verify
ar: تحقق

# wrongEmailToVerify
source: Wrong email?
ar: البريد الإلكتروني ليس صحيحاً؟

# changeEmailToVerify
source: go back to change it
ar: العودة لتعديله

# cannotConnectToServer
source: Cannot connect to server, please try again later.
ar: لا يمكن الاتصال بالخادم، الرجاء المحاولة مجدداً

# noInternetConnection
source: You are not connected! Please check your internet connection and try again.
ar: أنت غير متصل بالانترنت! يرجى التحقق من اتصالك بالانترنت والمحاولة مجدداً

# unauthorized
source: You are unauthorized to proceed.
ar: صلاحيات الوصول غير كافية

# unauthenticated
source: Please login before to preform this action.
ar: عذراً لم نتمكن من التحقق من هويتك، من فضلك قم بتسجيل الدخول مرة أخرى

# accountAlreadyExist
source: An account with your credentials already exists
ar: أنت مُسجّل مسبقاً! تأكد من البيانات المدخلة أو قم بإعادة تعيين كلمة المرور

# invalidLoginCredential
source: Incorrect email and\or password.
ar: البريد الالكتروني أو كلمة المرور غير صحيح

# accountAlreadyExists
source: An account with your credentials already exists, please login or reset your password
ar: يوجد حساب مسجل بهذا البريد الإلكتروني أو رقم الهاتف، قم بتسجيل الدخول أو إعادة تعيين كلمة المرور

# serverError
source: Unexpected error! In case of receiving this error repeatedly, please wait some time until we fix the issue.
ar: عذراً حدث خطأ غير متوقع. في حال حصولك على هذه الرسالة بشكل متكرر فيرجى الانتظار فنحن نعمل على حل المشكلة وشكراً لصبركم.

# undefinedException
source: An error occurred, please try again.
ar: عذراً حدث خطأ، يرجى المحاولة مجدداً

# signupFailed
source: Signup failed. Please try again.
ar: فشل إنشاء حساب جديد. يرجى المحاولة مجدداً

# forbidden
source: The request is forbidden. You are not authorized to access this resource.
ar: الطلب غير مسموح. يرجى التحقق من البيانات المدخلة

# emailAlreadyVerified
source: The email address has already been verified.
ar: بريدك الإلكتروني مؤكد مسبقاً

# phoneAlreadyVerified
source: The phone number has already been verified.
ar: رقمك الموبايل مؤكد مسبقاً

# invalidOTP
source: The OTP is invalid. Please make sure you have entered the correct code.
ar: رمز التحقق غير صحيح أو تم استخدامه مسبقاً. تأكّد من البيانات المدخلة أو اطلب رمزاً جديداً.

# expiredOTP
source: The OTP has expired. Please request a new one.
ar: الرمز منتهي الصلاحية. يرجى طلب رمز جديد

# confirmIdentity
source: Please confirm your identity.
ar: يرجى التحقق من هويتك

# rateLimitExceeded
source: You have sent too many requests. Please wait a while before trying again.
ar: لقد قمت بإرسال عدد كبير من الطلبات. يرجى الانتظار قبل المحاولة مجدداً

# locationServiceDisabled
source: Location services are disabled. Please enable them in your device settings to view nearby medical facilities.
ar: خدمات تحديد الموقع معطلة. يرجى تمكينها في إعدادات جهازك.

# locationPermissionDenied
source: Location permission is denied. Please grant the app permission to access your location to find nearby doctors and hospitals.
ar: تم رفض إذن الموقع. يرجى منح التطبيق إذنًا للوصول إلى موقعك.

# locationPermissionDeniedPermanently
source: Location permission is permanently denied. Please go to your device settings and grant the app permission to access your location.
ar: تم رفض إذن الموقع بشكل دائم. يرجى الانتقال إلى إعدادات جهازك ومنح التطبيق إذنًا للوصول إلى موقعك

# signupBtnLabel
source: Create my account
ar: إنشاء حسابي

# completeSignupBtnLabel
source: Complete registration
ar: إتمام إنشاء الحساب

# signupScreenTitle
source: Registering
ar: إنشاء حساب

# signupInProgress
source: Creating your account, please wait...
ar: جار إنشاء حساب جديد، يرجى الانتظار...

# sendingSignupCodeInProgress
source: Sending signup code, please wait...
ar: جار إرسال رمز التحقق، يرجى الانتظار...

# completeSignupFormSubtitle
source: Please fill your information
ar: يرجى إكمال معلوماتك الشخصية

# completeSignupFormTitle
source: Verification Success
ar: تم تأكيد رقمك بنجاح

# signupFailureDialogTitle
source: Signup failure
ar: فشل إنشاء حساب جديد

# signupWithEmailMessage
source: We will send a verification code to your email address:
ar: سنرسل رمز تحقق على البريد الإلكتروني الخاص بك:

# signupWithPhoneMessage
source: We will send a verification code to your phone number:
ar: سنرسل رمز تحقق إلى الهاتف الخاص بك:

# signupWithEmail
source: I want to receive the code via email
ar: أريد تلقي الرمز بالبريد الإلكتروني

# signupWithPhone
source: I want to receive the code via SMS
ar: أريد تلقي الرمز برسالة نصية

# signupCodeIsRequired
source: Please enter the confirmation code you recieved
ar: الرجاء إدخال رمز التأكيد

# signupCodeSentToEmail
source: We have sent a signup code to your email address:
ar: لقد أرسلنا رمز التحقق إلى البريد الإلكتروني الخاص بك:

# signupCodeSentToPhone
source: We have sent a signup code to your phone number:
ar: لقد أرسلنا رمز التحقق برسالة نصية إلى الرقم الخاص بك:

# signupCodeLengthIsInvalid
source: Signup code must be {length} characters long
ar: يجب أن يكون رمز التحقق مكون من {length} حرفاً

# signupCodeFieldLabel
source: Signup code
ar: رمز التحقق

# signupCodeFieldHint
source: Enter the code you received via email or phone
ar: أدخل الرمز المرسل إلى البريد الإلكتروني أو الهاتف

# popConfirmationDialogTitle
source: Are you sure you want to go back?
ar: هل أنت متأكد أنك تريد العودة؟

# stayOnPageBtnLabel
source: Stay on page
ar: البقاء في الصفحة

# goBackBtnLabel
source: Go back
ar: العودة

# openProfileBtnLabel
source: Open profile
ar: استعراض الملف الشخصي

# passwordRuleSpecialChar
source: Have one or more special characters
ar: يجب أن يحتوي على حرف خاص

# nameFieldLabel
source: Name
ar: الاسم

# nameFieldHint
source: Your name
ar: ادخل اسمك

# nameIsRequired
source: Please enter your name
ar: يرجى إدخال الاسم الخاص بك

# timeNow
source: Now
ar: الآن

# timeYesterday
source: Yesterday
ar: أمس

# timeHoursAgo
source: {hours}h ago
ar: منذ {hours} س

# timeDaysAgo
source: {days} days ago
ar: منذ {days} أيام

# commonRetry
source: Retry
ar: إعادة المحاولة

# commonCancel
source: Cancel
ar: إلغاء

# commonClose
source: Close
ar: إغلاق

# commonPublish
source: Publish
ar: نشر

# commonSubmit
source: Submit
ar: إرسال

# commonSearch
source: Search
ar: بحث

# commonClear
source: Clear
ar: مسح

# commonViewAll
source: View all
ar: عرض الكل

# commonLoadingMore
source: Loading more...
ar: جاري تحميل المزيد...

# communityTitle
source: Community
ar: المجتمع

# communityJoinToContribute
source: Join to contribute
ar: انضم للمشاركة

# communityAskQuestion
source: Ask a question
ar: اطرح سؤالاً

# communityAddReview
source: Add a review
ar: أضف تجربة

# communityFilterAll
source: All
ar: الكل

# communityFilterQuestions
source: Questions
ar: الأسئلة

# communityFilterReviews
source: Reviews
ar: التجارب

# communityNoContentTitle
source: No content yet
ar: لا يوجد محتوى بعد

# communityNoContentSubtitle
source: Start the conversation!
ar: ابدأ المحادثة!

# communityNoResultsTitle
source: No results
ar: لا توجد نتائج

# communityNoResultsSubtitle
source: Try different keywords.
ar: جرّب كلمات بحث مختلفة.

# communityQuestionsCountLabel
source: Questions
ar: سؤال

# communityReviewsCountLabel
source: Reviews
ar: تجربة

# trimCommunityReviewsTab
source: Reviews
ar: التجارب

# trimCommunityQaTab
source: Q&A
ar: سؤال وجواب

# trimCommunityNoReviews
source: No reviews yet
ar: لا توجد تجارب بعد

# trimCommunityNoQuestions
source: No questions yet
ar: لا توجد أسئلة بعد

# sheetAskQuestionTitle
source: Ask a question
ar: اطرح سؤالاً

# sheetAskQuestionSubtitle
source: Ask the community and get help from owners.
ar: اسأل المجتمع واحصل على إجابات من المالكين.

# sheetAddReviewTitle
source: Add your review
ar: أضف تجربتك

# sheetAddReviewSubtitle
source: Share your experience to help others.
ar: شارك تجربتك لمساعدة الآخرين.

# authRequiredToPostQuestion
source: You must be signed in to ask a question.
ar: يجب تسجيل الدخول لطرح سؤال.

# authRequiredToPostReview
source: You must be signed in to add a review.
ar: يجب تسجيل الدخول لإضافة تجربة.

# authRequiredToPostAnswer
source: You must be signed in to answer.
ar: يجب تسجيل الدخول لإضافة إجابة.

# fieldTrimLabelRequired
source: Car (trim) *
ar: السيارة (النسخة) *

# fieldTrimLabelOptional
source: Car (trim)
ar: السيارة (النسخة)

# fieldTrimTapToSelect
source: Tap to select
ar: اضغط للاختيار

# fieldQuestionTitleLabel
source: Question title *
ar: عنوان السؤال *

# fieldQuestionBodyLabel
source: Question details *
ar: تفاصيل السؤال *

# fieldReviewTitleLabelOptional
source: Review title (optional)
ar: عنوان التجربة (اختياري)

# fieldReviewBodyLabel
source: Review details *
ar: تفاصيل التجربة *

# fieldCityLabelOptional
source: City (optional)
ar: المدينة (اختياري)

# buttonPublishQuestion
source: Post question
ar: نشر السؤال

# buttonPublishReview
source: Post review
ar: نشر التجربة

# buttonPostAnswer
source: Post answer
ar: نشر الإجابة

# validationSelectTrim
source: Please select a trim.
ar: الرجاء اختيار النسخة.

# validationQuestionTitleRequired
source: Please enter a title.
ar: الرجاء إدخال عنوان السؤال.

# validationQuestionTitleTooShort
source: Title is too short.
ar: العنوان قصير جداً.

# validationQuestionBodyRequired
source: Please enter details.
ar: الرجاء إدخال تفاصيل السؤال.

# validationQuestionBodyTooShort
source: Details are too short.
ar: التفاصيل قصيرة جداً.

# validationReviewBodyRequired
source: Please enter review details.
ar: الرجاء كتابة تفاصيل التجربة.

# validationReviewBodyTooShort
source: Details are too short.
ar: التفاصيل قصيرة جداً.

# reviewTypeLabel
source: Review
ar: تجربة

# questionTypeLabel
source: Question
ar: سؤال

# answerTypeLabel
source: Answer
ar: إجابة

# trimPickerTitle
source: Select a trim
ar: اختر النسخة

# trimPickerSearchHint
source: Search trims...
ar: ابحث عن نسخة...

# homeSearchHint
source: Search by model or brand
ar: ابحث باسم السيارة أو العلامة

# homeTrendingTitle
source: Trending now
ar: الأكثر رواجاً

# homeLatestQuestionsTitle
source: Latest questions
ar: أحدث الأسئلة

# homeLatestReviewsTitle
source: Latest reviews
ar: أحدث التجارب

# homeSearchResultsCount
source: {count} results
ar: {count} نتيجة

# homeErrorTitle
source: Something went wrong
ar: حدث خطأ

# homeErrorSubtitle
source: Please try again.
ar: يرجى المحاولة مرة أخرى.

# commonFeatured
source: Featured
ar: مميز

# vehicleDetailsSimilarTitle
source: Similar cars
ar: سيارات مشابهة

# vehicleDetailsAlsoLikedTitle
source: People also liked
ar: قد تعجبك أيضاً

# vehicleDetailsSpecsTitle
source: Specifications
ar: المواصفات

# vehicleDetailsDescriptionTitle
source: Description
ar: الوصف

# cityDamascus
source: Damascus
ar: دمشق

# cityAleppo
source: Aleppo
ar: حلب

# cityHoms
source: Homs
ar: حمص

# cityHama
source: Hama
ar: حماة

# cityLatakia
source: Latakia
ar: اللاذقية

# cityTartus
source: Tartus
ar: طرطوس

# profileMyActivityTitle
source: My activity
ar: نشاطي

# profileMyReviewsTab
source: My reviews
ar: تجاربي

# profileMyQuestionsTab
source: My questions
ar: أسئلتي

# profileMyAnsweredQuestionsTab
source: Answered
ar: أجبتُ

# profileEmptyMyReviewsTitle
source: No reviews yet
ar: لا توجد تجارب بعد

# profileEmptyMyReviewsSubtitle
source: Write your first review to help others.
ar: أضف تجربتك الأولى لمساعدة الآخرين.

# profileEmptyMyQuestionsTitle
source: No questions yet
ar: لا توجد أسئلة بعد

# profileEmptyMyQuestionsSubtitle
source: Ask your first question and get help from the community.
ar: اطرح سؤالك الأول واحصل على مساعدة من المجتمع.

# profileEmptyMyAnsweredTitle
source: No answered questions yet
ar: لا توجد إجابات بعد

# profileEmptyMyAnsweredSubtitle
source: Answer questions to support the community.
ar: ساهم بالإجابة عن الأسئلة لدعم المجتمع.

# profileBrowseCarsCta
source: Browse cars
ar: تصفح السيارات

# profileAskQuestionCta
source: Ask a question
ar: اطرح سؤالاً

# profileBrowseCommunityCta
source: Browse community
ar: تصفح المجتمع
